public/autobiography/high-school-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="chronological.html">Chronological</a> &gt;
</p>

<div id="outline-container-orgd167baf" class="outline-2">
<h2 id="orgd167baf">High School</h2>
<div class="outline-text-2" id="text-orgd167baf">
<p>
Yet, I was a very shy and introverted person, and quite socially
awkward and isolated. On my last year of high school I began pushing
myself out of my comfort zone and partecipated in some activities like
<a href="../ephemeris/2025-05-14.html">theater</a>, creative writing and <a href="https://www.youtube.com/watch?v=JHoOj4z4-qs">public speaking</a>. This was the bravest
decision of my life and it would change its course. Slowly, I
started getting used to going outside of my room and being surrounded
by other people, something I was greatly struggling (and still do
sometimes). I also met F which helped me a lot with my self confidence
and isolation.
</p>

<p>
I also travelled by myself for the fist time: I went to <a href="../stash/photography/sicily.html">Sicily</a> several
times, I still remember those days vividly, then to Florence for a
performance and to Turin for the national final of the cybersecurity
olimpiads. I graduated with top marks and I started writing my diary.
</p>

<p>
I <a href="university.html">continued my studies</a> in Computer Science in Trento, in the beautiful
Italian Alps.
</p>

<hr />

<p>
&gt; <a href="early-life.html">Early Life</a> &gt; <a href="middle-school.html">Middle School</a> &gt; <a href="high-school.html">High School 1</a> &gt; High School 2 &gt; <a href="university.html">University</a> &gt; &#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
